openfoam3/final_project/mach-1p5-fine/system/probeDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  7
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      probeDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
type            probes;
libs            ("libsampling.so");
writeControl    timeStep;
writeInterval   1;
fields          (p);
probeLocations
(
    (0.6 0.005 0.0)
);
// ************************************************************************* //
